In [5]:
import pandas as pd

In [6]:
df1 = pd.DataFrame({'AGE':[16,20], 'Income':[1000,2000]})
df2 = pd.DataFrame({'AGE':[25,27], 'Income':[1500,2500]})

In [7]:
df1

   AGE  Income
0   16    1000
1   20    2000

In [8]:
df2

   AGE  Income
0   25    1500
1   27    2500

In [9]:
df1 = df1.rename(columns={'AGE':'Age', 'Income':'Income'})
df1

   Age  Income
0   16    1000
1   20    2000

In [10]:
df2 = df2.rename(columns={'AGE':'Age', 'Income':'Income'})
df2

   Age  Income
0   25    1500
1   27    2500

In [13]:
result = pd.concat([df1, df2])
result

   Age  Income
0   16    1000
1   20    2000
0   25    1500
1   27    2500

In [14]:
result = pd.concat([df1, df2], axis=1)
result

   Age  Income  Age  Income
0   16    1000   25    1500
1   20    2000   27    2500